burning-airlines-server/app/controllers/airplanes_controller.rb

  def create
    @airplane = Airplane.create airplane_params
---
INSERT INTO "airplanes" ("name", "row", "column", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "780"], ["row", "42"], ["column", "E"], ["created_at", "2022-09-14 00:41:23.252744"], ["updated_at", "2022-09-14 00:41:23.252744"]]

  def index
    @airplanes = Airplane.all
---
SELECT "airplanes".* FROM "airplanes"

  def show
    @airplane = Airplane.find params [:id]
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]