burning-airlines-server/app/controllers/flights_controller.rb

  def create
    @flight = Flight.create flight_params
---
INSERT INTO "flights" ("date", "origin", "destination", "flight_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2022-09-15"], ["origin", "BRI"], ["destination", "CBR"], ["flight_number", 444], ["created_at", "2022-09-14 00:56:57.483877"], ["updated_at", "2022-09-14 00:56:57.483877"]]

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def show
    @flight = Flight.find_by params[:flight_number]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."flight_number" = $1 LIMIT $2  [["flight_number", 154], ["LIMIT", 1]]