burning-airlines-server/app/controllers/flights_controller.rb

  def show
    @flight = Flight.find params[:id]
---
SELECT  "flights".* FROM "flights" LIMIT $1  [["LIMIT", 1]]