burning-airlines-server/app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.create reservation_params
---
INSERT INTO "reservations" ("row", "column", "created_at", "updated_at", "user_id", "flight_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["row", "2"], ["column", "A"], ["created_at", "2022-09-14 22:39:18.738221"], ["updated_at", "2022-09-14 22:39:18.738221"], ["user_id", 105], ["flight_id", 101]]

  def index
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def show
    @reservation = Reservation.find params[:id]
---
SELECT  "reservations".* FROM "reservations" ORDER BY "reservations"."id" DESC LIMIT $1  [["LIMIT", 1]]