burning-airlines-server/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Brendan"], ["LIMIT", 1]]
---
  def find #a custom route
    @user = User.find_by name: params[:name]